In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Amit','Amol','Ajit','Ajay'],
    "marks":[91, 90, 78, 89],
    "city":['Jath','Sangola','Sangli','Solapur']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [6]:
  df.to_csv('borthers.csv')

In [7]:
dict1 = {
    "name":['Prashant','Sushant','Amit','Ajay'],
    "marks":[91, 90, 78, 89],
    "city":['Jath','Sangola','Sangli','Solapur']
}

In [8]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [9]:
df = pd.DataFrame(df)

In [10]:
df

   name  marks     city
0  Amit     91     Jath
1  Amol     90  Sangola
2  Ajit     78   Sangli
3  Ajay     89  Solapur

In [11]:
df = pd.DataFrame(dict1)

In [12]:
df

       name  marks     city
0  Prashant     91     Jath
1   Sushant     90  Sangola
2      Amit     78   Sangli
3      Ajay     89  Solapur

In [13]:
pd.to_csv(df)

AttributeError: module 'pandas' has no attribute 'to_csv'

In [15]:
df.to_csv('brothers.csv')

In [17]:
df.to_csv('brothers_index_false.csv', index=False)